/* REXX */
 dsn_in = "DATA.Y20D1"

 "ALLOC DD(DSIN) DATASET('"dsn_in"') SHR"
 "EXECIO * DISKR DSIN(FINIS STEM input."
 "FREE FILE(DSIN)"

 sum = 2020

 DO i = 1 TO (input.0-1)
   DO j = 2 TO input.0
     test = input.i + input.j
     IF test = sum THEN
       DO
         answer = input.i * input.j
         LEAVE i
       END
   END
 END

 Say "AOC-Y2020-D1P1: Answer:" answer


 EXIT 0
