/* REXX */
 dsn_in = "DATA.Y20D1"

 "ALLOC DD(DSIN) DATASET('"dsn_in"') SHR"
 "EXECIO * DISKR DSIN(FINIS STEM input."
 "FREE FILE(DSIN)"

 sum = 2020

 DO i = 1 TO (input.0-2)
   DO j = i + 1 TO (input.0-1)
     DO k = j + 1 TO  input.0
      test = input.i + input.j + input.k
      IF test = sum THEN
       DO
         answer = input.i * input.j * input.k
         LEAVE i
       END
     END
   END
 END

 Say "AOC-Y2020-D1P2: Answer:" answer


 EXIT 0
