/* rexx */
dsn_in = "DATA.Y20D2"

"ALLOC DD(DSIN) DATASET('"dsn_in"') SHR"
"EXECIO * DISKR DSIN(FINIS STEM input."
"FREE FILE(DSIN)"

valid_count = 0
DO i = 1 TO input.0
  PARSE VAR input.i min '-' max ' ' char ':' password
  count = 0
  DO j = 1 TO LENGTH(password)
      IF SUBSTR(password, j, 1) = char THEN count = count + 1
  END
  IF count >= min & count <= max THEN valid_count = valid_count + 1
END

SAY "AOC-Y2020-D2P1: Valid Passwords:" valid_count
EXIT 0
