/* REXX */
dsn_in = "DATA.Y21D2"

"ALLOC DD(DSIN) DATASET('"dsn_in"') SHR"
"EXECIO * DISKR DSIN(FINIS STEM input."
"FREE FILE(DSIN)"

depth = 0
position = 0
aim = 0
DO i = 1 TO input.0
  PARSE VAR input.i direction amount
  SELECT
    WHEN direction = "forward" THEN DO
      position = position + amount
      depth = depth + aim * amount
    END
    WHEN direction = "down"    THEN aim = aim + amount
    WHEN direction = "up"      THEN aim = aim - amount
  END
END

NUMERIC DIGITS 10
Say "AOC-Y2021-D2P2: Answer:" position * depth
EXIT 0
