/* REXX */
dsn_in = "DATA.Y22D4"
"ALLOC DD(DSIN) DATASET('"dsn_in"') SHR"
"EXECIO * DISKR DSIN(FINIS STEM input.)"
"FREE FILE(DSIN)"

count = 0
DO i = 1 TO input.0
  PARSE VAR input.i low1 "-" high1 "," low2 "-" high2
  IF (low1 <= low2 & high1 >= high2) | (low2 <= low1 & high2 >= high1) THEN
    count = count + 1
END

SAY "AOC-Y22D4P1: Answer:" count
EXIT 0
